Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: This aspect of C<pop> is considered highly experimental.
es_es: Este aspecto de C<pop> es considerado altamente experimental.

source: open(my $dbase, "+<", "dbase.mine") # open for update
es_es: open(my $dbase, "+<", "dbase.mine") # abrir para actualizar

source: $file = <blurch*>;
es_es: $archivo = <loquesea*>;

source: =item use Module LIST
es_es: =item use Módulo LISTA

source: When used with C<@>, the repeat count represents an offset from the start of the innermost C<()> group.
es_es: Cuando se utiliza con C<@>, el número de repeticiones representa un desplazamiento desde el inicio del grupo C<()> más interior.

source: You also do not have to use mpeix/relink after building, so the recommend sequence is:
es_es: También no tiene que utilizar mpeix/relink después de la compilación, por lo que la secuencia recomendada es:

source: =item chdir EXPR X<chdir> X<cd> X<directory, change>
es_es: =item chdir EXPR X<chdir> X<cd> X<directory, change> X<directorio, cambio>

source: Where an argument is specified by an explicit index, this does not affect the normal order for the arguments, even when the explicitly specified index would have been the next argument.
es_es: Cuando se especifica un argumento por un índice explícito, esto no afecta el orden normal de los argumentos, incluso cuando el índice especificado explícitamente habría sido el siguiente argumento.

source: Here is an example to illustrate how the bits actually fall in place:
es_es: Este es un ejemplo para ilustrar cómo los bits están amparados efectivamente en su lugar:

source: (Contributed by Gisle Aas.)
es_es: (Escrito por Gisle Aas.)

source: This also behaves similarly, but avoids $_ :
es_es: Esto también se comporta de forma similar, pero evita $_:

source: Instead of -pthread put here -lthread.
es_es: en lugar de -pthread, ponga -lthread.

source: then C<%hash> will have at least 200 buckets allocated for it--256 of them, in fact, since it rounds up to the next power of two.
es_es: entonces C<%hash> tendrá al menos 200 alojamientos de memoria reservados para él -- 256 de ellos, de hecho, ya que se redondea a la siguiente potencia de dos.

source: Setting $0 now works.
es_es: Ahora funciona el establecer $0.

source: @days # ($days[0], $days[1],... $days[n])
es_es: @dias # ($dias[0], $dias[1],... $dias[n])

source: This document describes differences between the 5.9.0 and the 5.9.1 development releases.
es_es: Este documento describe las diferencias entre las versiones de desarrollo 5.9.0 y la 5.9.1.

source: BINMODE this
es_es: BINMODE este

source: - subtraction
es_es: - resta

source: $str .= "\x{0e0b}"; # Now $str is in UTF-8 format.
es_es: $str .= "\x{0e0b}"; # Ahora, $str está en formato UTF-8.

source: All unqualified dynamic identifiers in this scope will be in the given namespace, except where overridden by another C<package> declaration or when they're one of the special identifiers that qualify into C<main::>, like C<STDOUT>, C<ARGV>, C<ENV>, and the punctuation variables.
es_es: Todos los identificadores dinámicos no cualificados en este ámbito pertenecerán al espacio de nombres indicado, salvo cuando sea reemplazado por otra declaración C<package> o cuando sean uno de los identificadores especiales que cualifican dentro de C<main::>, al igual que C<STDOUT>, C<ARGV>, C<ENV>, y las variables especiales de caracteres de puntuación.

source: $foo = '150' | 105; # yields 255
es_es: $foo = '150' | 105; # produce 255

source: Diamond inheritance now works.
es_es: La herencia de diamante ahora funciona.

source: =head3 Breaking out
es_es: =head3 Saliendo

source: In particular, bugs/features of the compiler used may lead to breakage of some of the above rules.
es_es: En particular, determinados errores o características del compilador usado pueden provocar la infracción de algunas de las normas anteriores.

source: The root cause is that there is no interface for the implementors of tied hashes to implement the behaviour of a hash in scalar context.
es_es: La causa principal es que no existe una interfaz para los implementadores de los hashes enlazados para implementar el comportamiento de un hash en contexto escalar.

source: If you want to set @ARGV to your own list of files, go right ahead.
es_es: Si desea establecer @ARGV a su propia lista de archivos, adelante.

source: The permission (or "mode") values you pass C<mkdir> or C<sysopen> are modified by your umask, so even if you tell C<sysopen> to create a file with permissions C<0777>, if your umask is C<0022>, then the file will actually be created with permissions C<0755>.
es_es: El valor de permiso (o "modo") que se pasa a C<mkdir> o C<sysopen> son modificados por su C<umask>, así que incluso si usted le pide a C<sysopen> crear un archivo con permisos C<0777>, y su C<umask> es C<0022>, entonces el archivo realmente es creado con permisos C<0755>.

source: Except where otherwise noted, you should assume that C<use strict> and C<use warnings> statements appear earlier in the "program", and that any variables used have already been declared, even if those declarations have been omitted to make the example easier to read.
es_es: Salvo si se indica lo contrario, debe suponer que al principio del "programa" se incluyen las instrucciones C<use strict> y C<use warnings>, y que todas las variables han sido declaradas, aunque se omitan las declaraciones para facilitar la lectura del ejemplo.

source: =head2 Linker Problems in Irix
es_es: =head2 Problemas de enlazado en Irix

source: if (/^-v/) { $verbose++ }
es_es: if (/^-v/) { $verboso++ }

source: An C<eval ''> executed within the C<DB> package doesn't see the usual surrounding lexical scope, but rather the scope of the first non-DB piece of code that called it.
es_es: Un C<eval ''> ejecutado dentro del paquete C<DB> no ve el usual ámbito léxico circundante, sino más bien el ámbito de la primera parte del código no-DB que le llamó.

source: The stability of these extensions varies widely.
es_es: La estabilidad de estas extensiones varía ampliamente.

source: Include POD for a given method right above that method's subroutine.
es_es: Incluya POD para un determinado método justo por encima de la subrutina del método.

source: If you increment a variable that is numeric, or that has ever been used in a numeric context, you get a normal increment.
es_es: Si usted incrementa una variable que es numérica, o que haya sido utilizada en un contexto numérico, se obtiene un incremento normal.

source: (The following is a comprehensive reference to open(): for a gentler introduction you may consider L<perlopentut>.)
es_es: (Lo siguiente es una referencia general a open(): para una introducción más suave puede considerar L<perlopentut>).

source: Exhaustive information on the topic of references can be found in L<perlreftut>, L<perllol>, L<perlref> and L<perldsc>.
es_es: Encontrará información detallada sobre las referencias en L<perlreftut>, L<perllol>, L<perlref> y L<perldsc>.

source: Note that the modifiers affect only pattern matching, and do not extend to any replacement done.
es_es: Tenga en cuenta que los modificadores afectan sólo a la coincidencia de patrones, y no se extienden a ningún reemplazo.

source: =head2 Building with threads in Irix
es_es: =head2 Compilando con hilos en Irix

source: =item alarm SECONDS X<alarm> X<SIGALRM> X<timer>
es_es: =item alarm SEGUNDOS X<alarm> X<SIGALRM> X<timer> X<alarma> X<temporizador>

source: This has been fixed [RT #53746].
es_es: Esto ha sido corregido [RT #53746].

source: *before* the "make -f Makefile.micro".
es_es: *antes* del "make -f Makefile.micro".

source: print hex '0xAf'; # prints '175'
es_es: print hex '0xAf'; # imprime '175'

source: unlink $filename;
es_es: unlink $archivo;

source: Because C<$body> is now a byte string, C<length> will report the number of bytes, instead of the number of characters.
es_es: Como C<$cuerpo_texto> es una cadena de bytes, C<length> devolverá el número de bytes, en lugar del número de caracteres.

source: If LIMIT is specified and positive, it represents the maximum number of fields the EXPR will be split into, though the actual number of fields returned depends on the number of times PATTERN matches within EXPR.
es_es: Si LÍMITE está especificado y es positivo, representa el máximo número de campos que EXPR será dividido, aunque el número real de campos devueltos depende del número de veces que PATRÓN concuerda en EXPR.

source: =item no MODULE
es_es: =item no MÓDULO

source: A minor release is one in which a small amount of functionality has been added or changed.
es_es: Una versión menor es aquella en la que una pequeña cantidad de funcionalidad ha sido añadida o cambiada.

source: What gets returned depends on several factors:
es_es: Lo que se devuelve depende de varios factores:

source: Otherwise, the variable is implicitly local to the loop and regains its former value upon exiting the loop.
es_es: Dicho de otra forma, la variable es implícitamente local al bucle y recupera su valor anterior al salir del bucle.

source: Only characters C<A-Z> change, to C<a-z> respectively.
es_es: Sólo los caracteres C<A-Z> cambian, a C<a-z>, respectivamente.

source: require "sys/ioctl.ph"; # probably in $Config{archlib}/sys/ioctl.ph
es_es: require "sys/ioctl.ph"; # probablemente en $Config{archlib}/sys/ioctl.ph

source: $str = "\xDF"; # $str is not in UTF-8 format.
es_es: $str = "\xDF"; # $str no está en formato UTF-8.

source: You can change the way that an object is matched by overloading the C<~~> operator.
es_es: Puede cambiar la forma en que un objeto es comparado, sobrecargando el operador C<~~>.

source: The major reference book on Perl, written by the creator of Perl, is I<Programming Perl>:
es_es: El principal libro de referencia sobre Perl, escrito por el creador del lenguaje, es I<Programming Perl>:

source: The value of a character (C<ord>, C<chr>) is the corresponding Unicode code point.
es_es: El valor de un carácter (C<ord>, C<chr>) es el código de carácter Unicode correspondiente.

source: perlperf Perl Performance and Optimization Techniques
es_es: perlperf Rendimiento y técnicas de optimización

source: \Q quote non-word characters till \E
es_es: \Q escapa los caracteres no alfanuméricos hasta \E

# print "Starting analysis " if $verbose;
source: print "Starting analysis\n" if $verbose;
es_es: print "Empezando análisis\n" if $locuaz;

source: This also triggers an uninitialized warning.
es_es: Esto también desencadena una advertencia de datos no inicializados.

source: The locale used will be the one in effect at the time of execution of the pattern match.
es_es: La regla regional utilizada será la vigente en el momento de la ejecución de la coincidencia de patrón.

source: To guarantee this to be true, add a C<0> to the scalar before using it.) The C<pack> and C<unpack> functions may be needed to manipulate the values of structures used by C<ioctl>.
es_es: Para garantizar este último comportamiento, añada un C<0> al escalar antes de usarlo). Las funciones C<pack> y C<unpack> pueden ser necesarias para manipular los valores de las estructuras usadas por C<ioctl>.

source: %hash = map +( lc($_) => 1 ), @array # this is EXPR and works!
es_es: %hash = map +( lc($_) => 1 ), @array # esto es EXPR ¡y funciona!

source: Support for Atari MiNT was removed in Perl 5.11.0.
es_es: El soporte para Atari MiNT fue eliminado en Perl 5.11.0.

source: If a field width obtained through C<*> is negative, it has the same effect as the C<-> flag: left-justification.
es_es: Si un ancho de campo obtenidos a través de C<*> es negativo, tiene el mismo efecto que la bandera C<->: alineación a la izquierda.

source: Correct previous documentation: v-strings are not deprecated
es_es: Se corrige documentación anterior: los v-strings no son obsoletos

source: can be used instead of
es_es: se puede utilizar en lugar de

source: C<encoding::warnings> is now a lexical pragma.
es_es: C<encoding::warnings> es ahora un pragma léxico.

source: The current value of C<$\> (if any) is printed after the entire LIST has been printed.
es_es: El valor actual de C<$\> (si lo tiene) es impreso después de que toda la LISTA haya sido impresa.

source: =head2 Lexical C<$_>
es_es: =head2 C<$_> léxico

source: Perl should now build on Haiku.
es_es: Perl ahora debe compilarse en Haiku.

source: Add to your standard heading the following line:
es_es: Agregue al encabezado estándar de su programa la línea siguiente:

source: It is silently ignored for all other types.
es_es: Se ignora silenciosamente todos los demás tipos.

source: Here are two common cases:
es_es: Aquí hay dos casos comunes:

source: Binary "<<" returns the value of its left argument shifted left by the number of bits specified by the right argument.
es_es: Binario "<<" devuelve el valor de su argumento de la izquierda desplazado por el número de bits especificado por el argumento de la derecha.

source: $just_a = 1 when /^a/;
es_es: $solo_a = 1 when /^a/;

source: + one or more of the previous thing
es_es: + una o más coincidencias de lo anterior

source: Starting with Perl 5.14, C<keys> can take a scalar EXPR, which must contain a reference to an unblessed hash or array.
es_es: A partir de Perl 5.14, C<keys> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: When opening a file, it's seldom a good idea to continue if the request failed, so C<open> is frequently used with C<die>.
es_es: Al abrir un archivo, es difícil que sea una buena idea seguir si la solicitud ha fallado, por lo que C<open> se utiliza con frecuencia con C<die>.

source: Note that after the match, C<$cnt> returns to the globally introduced value, because the scopes that restrict C<local> operators are unwound.
es_es: Tenga en cuanta que después de la coincidencia, C<$cnt> devuelve el valor introducido globalmente, porque los ámbitos que imponen los operadores C<local> son desarmados en orden inverso al que se creó.

source: right ?:
es_es: derecha ?:

source: <= less than or equal
es_es: <= menor o igual que

source: Returns true for success, false on failure.
es_es: Devuelve verdadero para éxito, falso en caso de error.

source: The C<Test::Harness> timer is now off by default.
es_es: El temporizador C<Test::Harness> está apagado por defecto.

source: If you want either "-" or "]" itself to be a member of a class, put it at the start of the list (possibly after a "^"), or escape it with a backslash.
es_es: Si desea que sean los propios "-" o "]" como miembros de una clase, póngalos al principio de la lista (posiblemente después de un "^"), o escápelos con una barra invertida.

source: There can be whitespace between the operator and the quoting characters, except when C<#> is being used as the quoting character.
es_es: Puede haber espacios en blanco entre el operador y los caracteres delimitadores, excepto cuando C<#> se utiliza como carácter delimitador.

source: In scalar context, you get the name, unless the function was a lookup by name, in which case you get the other thing, whatever it is.
es_es: En contexto escalar, obtiene el nombre, a menos que la función fuera localizar por nombre, en cuyo caso obtendrá la otra cosa, cualquiera que sea.

source: perldbmfilter - Perl DBM Filters
es_es: perldbmfilter - Filtros DBM de Perl

source: if OS returns: then Perl returns:
es_es: si OS devuelve: entonces Perl devuelve:

source: This substitutes the question of "what is chosen?" by the question of "which matches are better, and which are worse?".
es_es: Esto sustituye la pregunta "¿qué es elegida?" por la cuestión "¿que coincidencia es mejor, y cuál es peor?".

source: perlcygwin Perl notes for Cygwin
es_es: perlcygwin Notas para Cygwin

source: For example, this match would fail:
es_es: Por ejemplo, esta búsqueda podría fallar:

source: =head3 Smart matching in detail
es_es: =head3 Coincidencia inteligente en detalle

source: Processing of C<\Q>, C<\U>, C<\u>, C<\L>, C<\l>, and interpolation happens as with C<qq//> constructs.
es_es: El procesamiento de C<\Q>, C<\U>, C<\u>, C<\L>, C<\l>, e interpolación ocurre igual que en las construcciones C<qq//>.

source: The final semicolon, if any, may be omitted from the value of EXPR or within the BLOCK.
es_es: El último punto y coma, si lo hay, puede ser omitido del valor de EXPR o dentro de BLOQUE.

source: A double-quoted, interpolated string.
es_es: Un doble entrecomillado, la cadena es interpolada.

source: If, on the other hand, you say
es_es: Por otra parte, si se escribe

source: Returns the number of characters actually read, C<0> at end of file, or undef if there was an error (in the latter case C<$!> is also set).
es_es: Devuelve el número de caracteres actualmente leídos, C<0> al final del archivo, o undef si hubo un error (en este último caso se actualiza el valor de C<$!>).

source: The fatal error "DESTROY created new reference to dead object" is now documented in L<perldiag>.
es_es: El error fatal "DESTROY creó una nueva referencia al objeto muerto" ya está documentada en L<perldiag>.

source: The inode change time of each file is set to the current time.
es_es: El tiempo de cambio de inodo de cada archivo se establece en la hora actual.

source: The rules for this are different for lower-level loops given by the greedy quantifiers C<*+{}>, and for higher-level ones like the C</g> modifier or split() operator.
es_es: Las reglas para esto son diferentes para los bucles de bajo nivel ofrecidos por los cuantificadores codiciosos C<*+{}>, y para los de más alto nivel como el modificador C</g> o el operador split().

source: Favorably in some areas, unfavorably in others.
es_es: Gana en algunos aspectos y pierde en otros.

source: It requires some time and patience to sift through all the content but often you will find the answer you seek.
es_es: "Vadear" toda esta información requiere tiempo y paciencia, pero normalmente encontrará la respuesta que busca.

source: =head2 Foreach Loops X<for> X<foreach>
es_es: =head2 Bucles Foreach X<for> X<foreach>

source: However, in a typical regular expression these elementary pieces are combined into more complicated patterns using combining operators C<ST>, C<S|T>, C<S*> etc. (in these examples C<S> and C<T> are regular subexpressions).
es_es: Sin embargo, en una típica expresión regular, estas piezas elementales se combinan en patrones más complicados con los operadores de combinación C<ST>, C<S|T>, C<S*>, etc (en estos ejemplos C<S> y C<T> son subexpresiones regulares).

source: And so on.
es_es: Y así sucesivamente.

# print "got <$1> ";
source: print "got <$1>\n";
es_es: print "obtiene <$1>\n";

source: On systems that support a real flock(2), locks are inherited across fork() calls, whereas those that must resort to the more capricious fcntl(2) function lose their locks, making it seriously harder to write servers.
es_es: En sistemas que soportan un flock(2) de verdad, los bloqueos se heredan a través de las llamadas fork(), teniendo en cuenta que se recurrirá a la caprichosa función fcntl(2) que pierde sus bloqueos, haciendo difícil escribir servidores.

source: # Assign a list of array references to an array.
es_es: # Asigna una lista de referencias de array a un array.

source: Perl has an B<internal format>, an encoding that it uses to encode text strings so it can store them in memory.
es_es: Perl utiliza un B<formato interno>, que es una codificación con la que se codifican las cadenas de texto para almacenarlas en memoria.

source: See L<perlsec> for details about both these mechanisms.
es_es: Vea L<perlsec> para obtener más detalles sobre estos dos mecanismos.

source: L<http://perlmonks.org/?node_id=238031> - Damian Conway's Perl 6 version
es_es: L<http://perlmonks.org/?node_id=238031> - Versión para Perl 6 de Damian Conway

source: EXTEND this, count
es_es: EXTEND este, contador

source: =item system LIST X<system> X<shell>
es_es: =item system LISTA X<system> X<shell>

source: C<isa()> checks for inheritance, while C<DOES()> has been designed to be overridden when module authors use other types of relations between classes (in addition to inheritance).
es_es: C<isa()> controla la herencia, mientras que C<DOES()> ha sido diseñado para ser sobre escrito cuando los autores de módulos utilicen otros tipos de relaciones entre las clases (además de la herencia).

source: =item truncate EXPR,LENGTH
es_es: =item truncate EXPR,LONGITUD

source: If MODE is C<< < >> or nothing, the file is opened for input.
es_es: Si MODO es C<< < >> o nada, el archivo se abre para lectura.

source: Additionally, quoting rules for the end-of-string identifier are unrelated to Perl's quoting rules.
es_es: Además, no están relacionadas las reglas de entrecomillado para el identificador del fin-de-cadena con las reglas de entrecomillado de Perl.

source: Available as a statement after Perl 5.10 and as a statement modifier after 5.14.
es_es: Disponible como una instrucción después de Perl 5.10 y como un modificador de instrucción después de 5.14.

source: If you want to sort the list returned by the function call C<find_records(@key)>, you can use:
es_es: Si quiere ordenar la lista devuelta por la llamada a la función C<find_records(@key)>, puede usar:

source: =item sysread FILEHANDLE,SCALAR,LENGTH,OFFSET X<sysread>
es_es: =item sysread IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD,DESPLAZAMIENTO X<sysread>

source: C<warnings> upgraded to version 1.05
es_es: C<warnings> actualizado a la versión 1.05

# print "$file is executable NFS file ";
source: print "$file is executable NFS file\n";
es_es: print "$archivo es un archivo NFS ejecutable\n";

source: This document describes various features of OpenBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de OpenBSD que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: For example C</(?<!bar)foo/> matches any occurrence of "foo" that does not follow "bar".
es_es: Por ejemplo C</(?<!bar)foo/> coincide con cualquier ocurrencia de "foo" que no esté seguido por "bar".

source: -1 undefined value 0 string "0 but true"
es_es: -1 valor indefinido 0 cadena "0 but true"

source: This section of the FAQ answers very general, high-level questions about Perl.
es_es: En esta sección de las preguntas más frecuentes se proporcionan respuestas a preguntas muy generales sobre Perl.

source: See the C<$/> and C<$\> variables in L<perlvar> for how to manually set your input and output line-termination sequences.
es_es: Ver las variables C<$/> y C<$\> en L<perlvar> para cómo poner manualmente sus secuencias de fin de línea en su entrada y salida.

source: This often resulted in blocking operations terminating prematurely or returning incorrect results, when Perl was executing under environments that could generate Windows messages.
es_es: A menudo, esto resultó en el bloqueo de las operaciones, finalizando antes de tiempo, o la devolución de resultados incorrectos, cuando se estaba ejecutando Perl bajo entornos que podrían generar mensajes de Windows.

source: This isn't supposed to happen.
es_es: Se supone que esto no debe de ocurrir.

source: This allows a build to complete with PERL_UNICODE set and a UTF-8 locale.
es_es: Esto permite tener una compilación con PERL_UNICODE activado y una localización de UTF-8.

source: You should post source code to whichever group is most appropriate, but feel free to cross-post to comp.lang.perl.misc.
es_es: Debe publicar código fuente en el grupo más apropiado, pero también lo puede publicar en comp.lang.perl.misc.

source: A lot of bugs have been fixed since v1.60, the version included in Perl v5.8.0.
es_es: Muchos errores se han corregido desde v1.60, la versión incluida en Perl v5.8.0.
